; domain
(define (domain Domain1)

    (:requirements :strips)

    (:predicates
        (AGENT ?t) (LOCATION ?l)
        (AIRPLANE ?a)
        (CAR ?c)
        (ground_conn ?l1 ?l2)
        (sky_conn ?l1 ?l2)
        (agentat ?a ?l)
        (carat ?c ?l)
        (airplaneat ?a ?l)
        (notonairplane ?a ?air)
        (notoncar ?a ?c)
        (oncar ?a ?car)
        (onairplane ?a ?air)
    )

    (:action getonthecar
        :parameters (?agent ?car ?location ?airplane)
        :precondition (and 
            (AGENT ?agent) (CAR ?car)  (AIRPLANE ?airplane) (LOCATION ?location)
            (carat ?car ?location) 
            (agentat ?agent ?location)
            (notonairplane ?agent ?airplane) (notoncar ?agent ?car)
        )
        :effect (and
            (oncar ?agent ?car) (not(notoncar ?agent ?car))
            (not(agentat ?agent ?location))
        )
    )
    
    (:action ridingcar
        :parameters (?car ?from ?to ?agent)
        :precondition (and
            (AGENT ?agent) (CAR ?car) 
            (oncar ?agent ?car) 
            (carat ?car ?from) 
            (ground_conn ?from ?to)
        )
        :effect (and
            (carat ?car ?to)
            (not(carat ?car ?from))
        )
    )
    
    (:action getoffthecar
        :parameters (?agent ?car ?location)
        :precondition (and 
            (AGENT ?agent) (CAR ?car) (oncar ?agent ?car) (LOCATION ?location)
            (carat ?car ?location) (oncar ?agent ?car)
        )
        :effect (and
            (not(oncar ?agent ?car))
            (agentat ?agent ?location)
            (notoncar ?agent ?car)
        )
    )
    
    (:action getontheairplane
        :parameters (?airplane ?agent ?location ?car)
        :precondition (and
            (AGENT ?agent) (CAR ?car)  (AIRPLANE ?airplane)
            (airplaneat ?airplane ?location) (agentat ?agent ?location)
            (notonairplane ?agent ?airplane) (notoncar ?agent ?car)
        )
        :effect (and
            (onairplane ?agent ?airplane) 
            (not(notonairplane ?agent ?airplane))
            (not(agentat ?agent ?location))
        )
    )
    
    (:action flyingairplane
        :parameters (?agent ?airplane ?from ?to)
        :precondition (and
            (AGENT ?agent) (AIRPLANE ?airplane) (LOCATION ?from) (LOCATION ?to) 
            (onairplane ?agent ?airplane) 
            (airplaneat ?airplane ?from) 
            (sky_conn ?from ?to)
        )
        :effect (and
            (airplaneat ?airplane ?to) 
            (not(airplaneat ?agent ?from))
        )
    )
    
    (:action getofftheairplane
        :parameters (?agent ?airplane ?location)
        :precondition (and 
            (AGENT ?agent) (AIRPLANE ?airplane) (LOCATION ?location)
            (onairplane ?agent ?airplane) (airplaneat ?airplane ?location)
        )
        :effect (and
            (notonairplane ?agent ?airplane)
            (agentat ?agent ?location)
            (not(onairplane ?agent ?airplane))
        )
    )
    
)

; problem
(define (problem Problem1)

    (:domain Domain1)
    
    (:objects
        agent
        house airport1 airport2
        car airplane
    )
    
    (:init  
        (AGENT agent)
        
        (LOCATION house) (LOCATION airport1) (LOCATION airport2)
        (AIRPLANE airplane) (CAR car)
        
        (ground_conn house airport1)
        (sky_conn airport1 airport2)
        
        (notonairplane agent airplane)
        (notoncar agent car)
        
        (agentat agent house)
        (carat car house)
        (airplaneat airplane airport1)
    )
    
    (:goal (and 
        (agentat agent airport2)
    ))
    
)

; plan
1. (getonthecar agent car house airplane)
   deleted: (notoncar agent car) (agentat agent house)
   added: (oncar agent car)
   goals met: 0 of 1
2. (ridingcar car house airport1 agent)
   deleted: (carat car house)
   added: (carat car airport1)
   goals met: 0 of 1
3. (getoffthecar agent car airport1)
   deleted: (oncar agent car)
   added: (agentat agent airport1) (notoncar agent car)
   goals met: 0 of 1
4. (getontheairplane airplane agent airport1 car)
   deleted: (notonairplane agent airplane) (agentat agent airport1)
   added: (onairplane agent airplane)
   goals met: 0 of 1
5. (flyingairplane agent airplane airport1 airport2)
   added: (airplaneat airplane airport2)
   goals met: 0 of 1
6. (getofftheairplane agent airplane airport2)
   deleted: (onairplane agent airplane)
   added: (notonairplane agent airplane) (agentat agent airport2)
   goals met: 1 of 1
